Samraksh/eMote/MicroFrameworkPK_v4_3/DeviceCode/Targets/Native/STM32F10x/DeviceCode/drivers/Timer/netmf_rtc/netmf_rtc.cpp
#include "netmf_rtc.h"
#include <stm32f10x.h>
#include <Samraksh/VirtualTimer.h>
#include <pwr/netmf_pwr.h>

STM32F10x_RTC g_STM32F10x_RTC;

void ISR_RTC_ALARM(void* Param);

//const uint16_t TIME_CUSHION = (uint16_t)(0.000015 * g_HardwareTimerFrequency[0]); // 15us @ 8 MHz
const UINT64 TIME_CUSHION = 10;

UINT32 STM32F10x_RTC::SetCounter(UINT32 counterValue)
{
	currentCounterValue = counterValue;
	RTC_SetCounter(currentCounterValue);
	return currentCounterValue;
}

UINT32 STM32F10x_RTC::GetCounter()
{
	return RTC_GetCounter();
}

UINT64 STM32F10x_RTC::Get64Counter()
{
	UINT32 currentValue = RTC_GetCounter();

	if(RTC_GetFlagStatus(RTC_FLAG_OW))
	{
		RTC_ClearFlag(RTC_FLAG_OW);

		// An overflow just happened, updating variable that holds system time
		g_STM32F10x_RTC.m_systemTime += (0x1ull <<32);
	}

	m_systemTime &= (0xFFFFFFFF00000000ull);
	m_systemTime |= currentValue;

	return m_systemTime;
}

// Initialize the advanced timer system. This involves initializing timer1 as a master timer and tim2 as a slave
// and using timer1 as a prescaler to timer2.
DeviceStatus STM32F10x_RTC::Initialize(UINT32 Prescaler, HAL_CALLBACK_FPN ISR, UINT32 ISR_Param)
{
	return DS_Success;
}

DeviceStatus STM32F10x_RTC::UnInitialize()
{
    callBackISR = NULL;
    RCC_APB1PeriphClockCmd(RCC_APB1Periph_BKP, ENABLE);
	PWR_BackupAccessCmd(ENABLE);
	RCC_RTCCLKCmd(DISABLE);
	PWR_BackupAccessCmd(DISABLE);

    return DS_Success;
}

// Set compare happens in two stages, the first stage involves setting the msb on tim2
// the second stage involves lsb on tim1
DeviceStatus STM32F10x_RTC::SetCompare(UINT64 compareValue)
{
	uint16_t tar_upper;
	uint16_t now_upper;
	uint16_t now_lower;
	UINT64 now;

	GLOBAL_LOCK(irq);
	now = Get64Counter();
	
	if (compareValue < (now + TIME_CUSHION)){
		compareValue = (now + TIME_CUSHION);
	}

	// RTC hardware needs to wait for synchronization at times.
	RTC_WaitForLastTask();
	RTC_WaitForSynchro();
	RTC_ClearFlag(RTC_FLAG_ALR);
	RTC_SetAlarm(compareValue);

	setCompareRunning = true;

	return DS_Success;
}

UINT32 STM32F10x_RTC::GetMaxTicks()
{
	return (UINT32)0xFFFFFFFF;
}

void ISR_RTC_ALARM(void* Param){
	// TODO: check for overflow
	RTC_ClearFlag(RTC_FLAG_ALR);
	RTC_ClearITPendingBit(RTC_FLAG_ALR);
	g_STM32F10x_RTC.setCompareRunning = false; // Reset
	g_STM32F10x_RTC.callBackISR(&g_STM32F10x_RTC.callBackISR_Param);
}

